{
  "events": [
    {
      "title": "تأسيس النادي",
      "date": "17/10/2019",
      "duration": "1",
      "description": "تم الإعلان عن تأسيس نادي بذرة خير في حفل رسمي بحضور إدارة الكلية وأعضاء هيئة التدريس والطلاب. تضمن الحفل محاضرة قيمة من الأستاذ هلايلي عبد الحق بعنوان 'أنت الحل أو أنت المشكل' والتي ناقشت دور الشباب في التغيير الإيجابي. تم خلال الحفل عرض رؤية النادي وأهدافه وفتح باب العضوية للطلاب المهتمين.",
      "category": "charity",
      "image": ""
    },
    {
      "title": "زيارة دار الطفولة المسعفة",
      "date": "27/10/2019",
      "duration": "1",
      "description": "نظم النادي زيارة إنسانية إلى مركز الطفولة المسعفة في سيدي بلعباس، حيث قام أعضاء النادي بجمع التبرعات والمستلزمات الضرورية للأطفال. تضمنت الزيارة أنشطة ترفيهية وتعليمية مع الأطفال، وتوزيع الهدايا والألعاب، وإقامة ورش رسم وأشغال يدوية، مما أدخل البهجة والسرور إلى قلوب الأطفال.",
      "category": "charity",
      "image": ""
    },
    {
      "title": "Huawei Networking Technology Course - Part 1",
      "date": "19-21/12/2019",
      "duration": "3s",
      "description": "الجزء الأول من الدورة التدريبية المتخصصة في تقنيات Huawei للشبكات. تضمنت الدورة مقدمة شاملة عن بنية الشبكات، وبروتوكولات التوجيه، وتكنولوجيا الشبكات المتقدمة. قدم المدرب تدريباً عملياً على معدات Huawei مع التركيز على المهارات الأساسية المطلوبة للمشاركة في المسابقة الدولية.",
      "category": "education",
      "image": ""
    },
    {
      "title": "Huawei Networking Technology Course - Part 2",
      "date": "17/01/2020",
      "duration": "2",
      "description": "استكمال الدورة التدريبية في تقنيات Huawei للشبكات مع التركيز على المواضيع المتقدمة. تضمن البرنامج تدريباً مكثفاً على تكوين الشبكات المعقدة، وحلول الأمان، وإدارة الشبكات الواسعة. شمل التدريب تطبيقات عملية وسيناريوهات واقعية لتعزيز المهارات التقنية للمشاركين.",
      "category": "education",
      "image": ""
    },
    {
      "title": "Adobe XD Course",
      "date": "07/03/2020",
      "duration": "1",
      "description": "دورة شاملة في تصميم واجهات المستخدم باستخدام Adobe XD قدمها المصممان المحترفان حجازي هشام وزايد زكرياء. تناولت الدورة أساسيات التصميم، وأدوات البرنامج، وأفضل الممارسات في تصميم UI/UX. تضمنت ورش عمل تطبيقية وتدريبات عملية على تصميم تطبيقات ومواقع ويب تفاعلية.",
      "category": "education",
      "image": ""
    },
    {
      "title": "زيارة متحف المجاهد",
      "date": "17/03/2020",
      "duration": "1",
      "description": "نظم النادي رحلة تاريخية إلى متحف المجاهد في سيدي بلعباس لإحياء ذكرى الشهداء والمجاهدين. شملت الزيارة جولة تفصيلية في أقسام المتحف، واستماع إلى شهادات حية، ومشاهدة وثائق وصور تاريخية. هدفت الزيارة إلى تعزيز الوعي التاريخي وغرس قيم الوطنية في نفوس الطلاب.",
      "category": "education",
      "image": ""
    },
    {
      "title": "حملة جمع التبرعات لمرضى كوفيد",
      "date": "10/07/2020",
      "duration": "1",
      "description": "أطلق النادي حملة تضامنية واسعة لجمع التبرعات لمرضى كوفيد-19 في مستشفيات سيدي بلعباس. شملت الحملة جمع المستلزمات الطبية، والمعقمات، والكمامات، ومواد التنظيف. تم تنظيم فريق متطوعين لفرز وتوزيع المساعدات على المستشفيات حسب احتياجاتها الملحة.",
      "category": "charity",
      "image": ""
    },
    {
      "title": "حملة تحسيسية بسرطان الثدي",
      "date": "14/10/2020",
      "duration": "2",
      "description": "حملة توعوية شاملة حول سرطان الثدي بالتعاون مع أخصائيين طبيين. تضمنت محاضرات عن أهمية الفحص المبكر، وورش عمل عن الفحص الذاتي، ونصائح حول النظام الغذائي الصحي. شملت الحملة توزيع منشورات توعوية، وعرض تجارب ناجين، وتقديم استشارات طبية مجانية.",
      "category": "education",
      "image": ""
    },
    {
      "title": "الذكرى الأولى لتأسيس النادي",
      "date": "17/10/2020",
      "duration": "1",
      "description": "احتفال بمرور عام على تأسيس النادي مع تنظيم معرض لإنجازات السنة الأولى. تضمن البرنامج عروضاً تقديمية عن مشاريع النادي، وتكريم الأعضاء المتميزين، وورش عمل تفاعلية. شمل اليوم أيضاً فتح باب العضوية للطلاب الجدد وعرض خطة النادي للسنة القادمة.",
      "category": "charity",
      "image": ""
    },
    {
      "title": "يوم توجيهي للطلبة الجدد",
      "date": "14/11/2020",
      "duration": "1",
      "description": "يوم إرشادي شامل لطلبة بكالوريا 2020 لتعريفهم بالتخصصات الجامعية المتاحة. تضمن البرنامج محاضرات تعريفية عن كل تخصص، ولقاءات مع أساتذة وطلاب متفوقين. قدم اليوم معلومات قيمة عن فرص العمل المستقبلية، ومتطلبات كل تخصص، مع جلسات استشارية فردية.",
      "category": "education",
      "image": ""
    },
    {
      "title": "Java Programming Course",
      "date": "06/02/2021",
      "duration": "1",
      "description": "دورة مكثفة في برمجة Java قدمها الأستاذ هشام حجازي. تناولت الدورة أساسيات البرمجة الكائنية، وهياكل البيانات، والخوارزميات الأساسية. تضمن البرنامج تطبيقات عملية، وحل المشكلات البرمجية، وتطوير مشاريع صغيرة. ركزت الدورة على أفضل ممارسات البرمجة وتقنيات كتابة الكود النظيف.",
      "category": "education",
      "image": ""
    },
    {
      "title": "IPv6 Network Course - Part 1",
      "date": "1/03/2021",
      "duration": "3",
      "description": "الجزء الأول من دورة متخصصة في بروتوكول IPv6 قدمها المدرب سعدي عبد الباري. تناولت أساسيات العنونة في IPv6، وآليات الانتقال من IPv4، وتكوين الشبكات. شملت الدورة تدريبات عملية على معدات حقيقية، وسيناريوهات تطبيقية، مع التركيز على أمن الشبكات وإدارتها.",
      "category": "education",
      "image": ""
    },
    {
      "title": "IPv6 Network Course - Part 2",
      "date": "10/04/2021",
      "duration": "2",
      "description": "استكمال دورة IPv6 المتقدمة مع المدرب سعدي عبد الباري. ركز هذا الجزء على التقنيات المتقدمة مثل التوجيه الديناميكي، وخدمات الشبكة، وحلول الأمان. تضمنت الدورة مشاريع عملية، وحالات دراسية واقعية، وتطبيقات على بيئات الإنتاج الفعلية.",
      "category": "education",
      "image": ""
    },
    {
      "title": "حملة التبرع بالماء لمرضى كوفيد",
      "date": "07/08/2021",
      "duration": "1",
      "description": "حملة إنسانية لتوفير المياه المعدنية لمرضى كوفيد-19 في مستشفيات سيدي بلعباس. شملت الحملة جمع التبرعات، وشراء كميات كبيرة من المياه المعدنية، وتنظيم عملية التوزيع. تم تشكيل فرق تطوعية للتنسيق مع إدارات المستشفيات وضمان وصول المياه للمرضى المحتاجين.",
      "category": "charity",
      "image": ""
    },
    {
      "title": "HCIA Routing & Switching Course",
      "date": "1/11/2021",
      "duration": "4",
      "description": "دورة تدريبية مكثفة للتحضير لشهادة HCIA في مجال التوجيه والتبديل. قدم المدرب سعدي عبد الباري تدريباً شاملاً على تقنيات الشبكات المتقدمة، وبروتوكولات التوجيه، وتكوين المعدات. تضمنت الدورة تدريبات عملية مكثفة، واختبارات تجريبية، ونصائح لاجتياز الامتحان الدولي.",
      "category": "education",
      "image": ""
    },
    {
      "title": "دورة المراجعة الشاملة للبكالوريا",
      "date": "3/04/2022",
      "duration": "5",
      "description": "برنامج مراجعة مكثف لطلاب البكالوريا في جميع التخصصات. شمل البرنامج دروساً في المواد الأساسية، وحل نماذج امتحانات سابقة، وتقديم نصائح للمذاكرة الفعالة. قدم أساتذة متخصصون شرحاً مفصلاً للمواضيع الصعبة، مع تدريبات وتمارين إضافية.",
      "category": "education",
      "image": ""
    },
    {
      "title": "دورة كتاب المستقبل",
      "date": "04/05/2022",
      "duration": "5",
      "description": "دورة متخصصة في فنون الكتابة والتأليف قدمتها الدكتورة خيرة بوخاري. تناولت الدورة أساسيات الكتابة الإبداعية، وتقنيات السرد، وأساليب التحرير والتنقيح. شملت ورش عمل تطبيقية، وتدريبات على كتابة النصوص المختلفة، مع تقديم نصائح عملية للنشر والتسويق.",
      "category": "education",
      "image": ""
    },
    {
      "title": "حملة جمع المستلزمات الدراسية",
      "date": "04/09/2022",
      "duration": "1",
      "description": "حملة خيرية بالتعاون مع جمعية مناهل الخير لجمع الأدوات المدرسية للأيتام والمحتاجين. شملت الحملة جمع الكتب، والقرطاسية، والحقائب المدرسية، وكل ما يلزم للعام الدراسي الجديد. تم تنظيم فريق متطوعين لفرز وتوزيع المستلزمات على العائلات المستفيدة.",
      "category": "charity",
      "image": ""
    },
    {
      "title": "الذكرى الثالثة لتأسيس النادي",
      "date": "17/10/2022",
      "duration": "1",
      "description": "احتفال بمرور ثلاث سنوات على تأسيس النادي مع استعراض الإنجازات والنجاحات. تضمن البرنامج معرضاً للمشاريع، وتكريم المتميزين، وورش عمل متنوعة. شمل اليوم أيضاً إطلاق مبادرات جديدة، وفتح باب العضوية، وتقديم رؤية النادي للمرحلة القادمة.",
      "category": "charity",
      "image": ""
    },
    {
      "title": "Fundamentals of Deep Learning",
      "date": "13/11/2022",
      "duration": "1",
      "description": "دورة متقدمة في الذكاء الاصطناعي والتعلم العميق قدمها عبد الغاني كبوط. تناولت الدورة أساسيات Deep Learning، وتطبيقات Neural Networks، وتقنيات Machine Learning المتقدمة. تضمنت تدريبات عملية على منصة NVIDIA، مع منح شهادات معتمدة للمشاركين.",
      "category": "education",
      "image": ""
    },
    {
      "title": "Informatique et Transformation des Matières",
      "date": "17/12/2022",
      "duration": "1",
      "description": "محاضرة متخصصة قدمها الأستاذ جواد عبد اللاوي حول أحدث التقنيات في معالجة وتحويل المواد. تناولت المحاضرة تطبيقات الحوسبة في الصناعة، والتقنيات الرقمية الحديثة، وأتمتة العمليات الصناعية. شملت عروضاً توضيحية وأمثلة عملية من الواقع الصناعي.",
      "category": "education",
      "image": ""
    },
    {
      "title": "Virtualization Workshop",
      "date": "24/12/2022",
      "duration": "1",
      "description": "ورشة عمل متخصصة في تقنيات Virtualization قدمها الأستاذ بوكلي حسن سفيان. تناولت الورشة مفاهيم المحاكاة الافتراضية، وتقنيات Container، وحلول Cloud Computing. تضمنت تطبيقات عملية على منصات مختلفة، مع التركيز على أفضل الممارسات في إدارة البيئات الافتراضية.",
      "category": "education",
      "image": ""
    },
    {
      "title": "زيارة متحف المجاهد",
      "date": "18/02/2023",
      "duration": "1",
      "description": "زيارة تثقيفية لمتحف المجاهد في سيدي بلعباس لتكريم ذكرى المجاهدين والشهداء. شملت الزيارة جولة في المعروضات التاريخية، والاستماع إلى قصص المقاومة، ومشاهدة الوثائق النادرة. هدفت الزيارة إلى تعزيز الروح الوطنية وربط الأجيال بتاريخهم المجيد.",
      "category": "education",
      "image": ""
    },
    {
      "title": "دورة المراجعة الشاملة للبكالوريا",
      "date": "2/02/2023",
      "duration": "5",
      "description": "برنامج مراجعة مكثف لطلاب البكالوريا يغطي جميع المواد الدراسية. تضمن البرنامج شرحاً تفصيلياً للمواضيع الصعبة، وحل نماذج امتحانات، وتقديم استراتيجيات المذاكرة الفعالة. قدم أساتذة متخصصون دروساً مركزة مع تمارين وتدريبات إضافية.",
      "category": "education",
      "image": ""
    },
    {
      "title": "الذكرى الرابعة لتأسيس النادي",
      "date": "12/10/2023",
      "duration": "1",
      "description": "احتفال بالذكرى الرابعة لتأسيس النادي مع تنظيم فعاليات متنوعة. تضمن البرنامج معرضاً للإنجازات، وتكريم المتميزين، وورش عمل تفاعلية. شمل اليوم إطلاق مبادرات جديدة، وعرض خطط مستقبلية، وأنشطة ترفيهية وتعليمية للطلاب.",
      "category": "charity",
      "image": ""
    },
    {
      "title": "Startups Awareness Day",
      "date": "20/11/2023",
      "duration": "1",
      "description": "يوم توعوي بالتعاون مع مدرسة المعالم حول المؤسسات الناشئة قدمته الأستاذة رفاس أسماء. تناول اليوم مراحل تأسيس Startup، واستراتيجيات التمويل، ودراسات الجدوى. تضمن البرنامج ورش عمل تطبيقية، وعرض قصص نجاح، ونصائح عملية لرواد الأعمال.",
      "category": "education",
      "image": ""
    },
    {
      "title": "Development Training",
      "date": "19/12/2023",
      "duration": "3",
      "description": "تدريب شامل في تقنيات البرمجة قدمه أمين صحراوي وملاتة منصف وهشام حجازي. تناول التدريب Web Development، وMobile Apps، وCloud Computing. تضمن البرنامج مشاريع عملية، وتطبيقات واقعية، مع التركيز على أحدث التقنيات والأدوات.",
      "category": "education",
      "image": ""
    },
    {
      "title": "دورة تعليم احكام التلاوة و التجويد",
      "date": "30/12/2023",
      "duration": "4",
      "description": "دورة متخصصة للنساء في تعليم أحكام التلاوة والتجويد مع التركيز على سورة الحجرات. تضمنت الدورة دروساً نظرية في قواعد التجويد، وتطبيقات عملية، وتصحيح التلاوة. قدمت مرشدات متخصصات تدريباً مكثفاً مع متابعة فردية للمشاركات.",
      "category": "education",
      "image": ""
    },
    {
      "title": "Smart Cities Conference",
      "date": "01/02/2024",
      "duration": "1",
      "description": "مؤتمر متخصص حول المدن الذكية قدمه الأستاذ خالفي محمد. تناول المؤتمر تطبيقات IoT، وتقنيات Smart Infrastructure، وحلول Urban Innovation. تضمن البرنامج عروضاً تقنية، ودراسات حالة، ومناقشات حول مستقبل المدن الذكية.",
      "category": "education",
      "image": ""
    },
    {
      "title": "Microservices Course",
      "date": "03/02/2024",
      "duration": "1",
      "description": "دورة متخصصة في هندسة Microservices قدمها الأستاذ بوكلي حسن سفيان. تناولت الدورة مفاهيم Service Architecture، وتقنيات Container Orchestration، وأنماط التصميم. تضمنت تطبيقات عملية على تجزئة التطبيقات وإدارة الخدمات المستقلة.",
      "category": "education",
      "image": ""
    },
    {
      "title": "يوم التوعية الصحية",
      "date": "03/03/2024",
      "duration": "1",
      "description": "يوم توعوي بالتعاون مع نادي باثوس حول الصحة المهنية في مجال تكنولوجيا المعلومات. تناول اليوم مشاكل Ergonomics، وإجهاد العين، وآلام الرقبة والظهر. تضمن البرنامج نصائح وقائية، وتمارين عملية، وإرشادات للحفاظ على الصحة أثناء العمل.",
      "category": "education",
      "image": ""
    },
    {
      "title": "Cisco Networking & Security",
      "date": "08/03/2024",
      "duration": "2",
      "description": "دورة متقدمة في شبكات وأمن Cisco قدمها المدرب سعدي عبد الباري. تناولت الدورة Network Security، وFirewall Configuration، وIntrusion Prevention. تضمنت تدريبات عملية على معدات Cisco، مع التركيز على حماية البنية التحتية للشبكات.",
      "category": "education",
      "image": ""
    },
    {
      "title": "دورة المراجعة الشاملة للبكالوريا",
      "date": "26/05/2024",
      "duration": "5",
      "description": "برنامج مراجعة مكثف لطلاب البكالوريا في جميع الشعب والمواد. تضمن البرنامج شرحاً تفصيلياً للمناهج، وحل نماذج امتحانات، وتقديم استراتيجيات للمذاكرة. قدم أساتذة متخصصون دروساً مركزة مع تمارين وتدريبات تحضيرية للامتحان.",
      "category": "education",
      "image": ""
    },
    {
      "title": "الذكرى الخامسة لتأسيس النادي",
      "date": "17/10/2024",
      "duration": "1",
      "description": "احتفال بمرور خمس سنوات على تأسيس النادي مع تنظيم فعاليات متنوعة. تضمن البرنامج معرضاً للإنجازات، وتكريم المؤسسين والأعضاء المتميزين، وورش عمل تفاعلية. شمل اليوم إطلاق مبادرات جديدة وعرض رؤية النادي للسنوات القادمة.",
      "category": "charity",
      "image": ""
    },
    {
      "title": "The Art of Marketing",
      "date": "09/11/2024",
      "duration": "1",
      "description": "محاضرة متخصصة في التسويق قدمها الأستاذ بنوتي الخليل. تضمن البرنامج معرضاً للمشاريع والابتكارات الطلابية، وورش عمل تفاعلية حول Digital Marketing. شملت المحاضرة استراتيجيات التسويق الحديثة، ودراسات حالة، وتطبيقات عملية في مجال التسويق الرقمي.",
      "category": "education",
      "image": ""
    },
    {
      "title": "يوم متلازمة داون",
      "date": "13/11/2024",
      "duration": "1",
      "description": "يوم تضامني مع أصحاب متلازمة داون من مركز النعمة. تضمن البرنامج حملة تشجير، وأنشطة فنية وترفيهية، وورش عمل إبداعية. شارك النوادي العلمية في تنظيم الفعاليات وتقديم الدعم والمساندة للمشاركين من ذوي متلازمة داون.",
      "category": "charity",
      "image": ""
    }
  ]
}


